IXM Identify Request - Test Sample.xml

<soapenv:Envelope xmlns:biom="http://niem.gov/niem/biometrics/1.0" xmlns:fn="http://www.w3.org/2005/xpath-functions" xmlns:ident="http://visit.dhs.gov/ident/6" xmlns:itl="http://biometrics.nist.gov/standard/2011" xmlns:j="http://niem.gov/niem/domains/jxdm/4.1" xmlns:nc="http://niem.gov/niem/niem-core/2.0" xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://visit.dhs.gov/ident/6 XSD/ident.xsd">
	<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:MessageID>DOS-1234</wsa:MessageID>
		<wsa:From>
			<wsa:Address>hostURI://from_CBP@dhs.gov</wsa:Address>
		</wsa:From>
		<wsa:To>https://usvisit.dhs.gov/soap/services/ixm</wsa:To>
		<wsa:ReplyTo>
			<wsa:Address>Gov.DHS.VISIT.ESB.iTest.Response</wsa:Address>
		</wsa:ReplyTo>
		<wsa:Action>http://visit.dhs.gov/ident/ixm/Identify</wsa:Action>
	</soapenv:Header>
	<soapenv:Body>
		<ident:IdentifyRequest xmlns:scr="http://niem.gov/niem/domains/screening/2.1">
			<ident:IdentifyOptions>
				<ident:EncounterRetentionOptions>
					<ident:EncounterRetentionCode>Always</ident:EncounterRetentionCode>
					<ident:MatcherEnrollCode>Always</ident:MatcherEnrollCode>
				</ident:EncounterRetentionOptions>
				<ident:ResultSetOptions>
					<ident:EncounterFormatOptions>
						<ident:EncounterBiometricsRequestList>
							<ident:EncounterBiometricsRequestListItem>
								<ident:EncounterBiometricsRequestCode>Fingerprint</ident:EncounterBiometricsRequestCode>
							</ident:EncounterBiometricsRequestListItem>
						</ident:EncounterBiometricsRequestList>
						<ident:ResultDetailLevelCode>List</ident:ResultDetailLevelCode>
						<ident:ResultVersionCompatibilityCode>6090</ident:ResultVersionCompatibilityCode>
					</ident:EncounterFormatOptions>
					<ident:EncounterFilterOptions>
						<ident:EncounterOrderingCode>Derogatory All</ident:EncounterOrderingCode>
					</ident:EncounterFilterOptions>
				</ident:ResultSetOptions>
			</ident:IdentifyOptions>
			<ident:Encounter>
				<ident:Activity>
					<nc:ActivityIdentification>
						<nc:IdentificationID>5683956839</nc:IdentificationID>
						<nc:IdentificationCategoryDescriptionText>TCN</nc:IdentificationCategoryDescriptionText>
					</nc:ActivityIdentification>
					<nc:ActivityCategoryText>Identity Investigation</nc:ActivityCategoryText>
					<nc:ActivityDate xmlns:nc="http://niem.gov/niem/niem-core/2.0">
						<nc:DateTime>2022-08-25T13:59:00Z</nc:DateTime>
					</nc:ActivityDate>
					<ident:OriginatingOrganization>
						<nc:OrganizationName>DOJ</nc:OrganizationName>
					</ident:OriginatingOrganization>
					<j:OrganizationORIIdentification>
						<nc:IdentificationID>DCFBIWAA4</nc:IdentificationID>
						<nc:IdentificationCategoryDescriptionText>ORI</nc:IdentificationCategoryDescriptionText>
					</j:OrganizationORIIdentification>
					<ident:OrganizationCRIIdentification>
						<nc:IdentificationID>NY0303000</nc:IdentificationID>
						<nc:IdentificationCategoryDescriptionText>CRI</nc:IdentificationCategoryDescriptionText>
					</ident:OrganizationCRIIdentification>
					<scr:ActivitySiteID>DCFBIWAA4</scr:ActivitySiteID>
				</ident:Activity>
				<ident:BiographicDetails>
					<ident:EncounterBiographic>
						<ident:PersonBiographic>
							<ident:PersonAddress>
								<nc:StructuredAddress>
									<nc:LocationStreet>
										<nc:StreetNumberText>5021</nc:StreetNumberText>
										<nc:StreetName>OAK LEAF DRIVE</nc:StreetName>
									</nc:LocationStreet>
									<nc:LocationCityName>BUFFALO</nc:LocationCityName>
									<ident:LocationStateCode>NY</ident:LocationStateCode>
									<nc:LocationPostalCode>14204</nc:LocationPostalCode>
								</nc:StructuredAddress>
								<ident:LocationCategoryCode>Home</ident:LocationCategoryCode>
							</ident:PersonAddress>
						</ident:PersonBiographic>
					</ident:EncounterBiographic>
				</ident:BiographicDetails>
				<ident:BiometricDetails>
					<ident:FingerprintImageSet>
						<itl:PackageFingerprintImageRecord>
							<biom:RecordCategoryCode>14</biom:RecordCategoryCode>
							<biom:ImageReferenceIdentification>
								<nc:IdentificationID>2</nc:IdentificationID>
							</biom:ImageReferenceIdentification>
							<biom:FingerImpressionImage>
								<nc:BinaryBase64Object>mrHbPdrko3u1s7ahtgPBjtmO1s85tfG2U7bpofY9
			4Czu2SbY7d7wF9fQ7ZptgGrtkO2a2dsJ7wZbe 8BlzvAmQ7xq+Y94GoHeEsR3ikWd4DIGhzmp3k42
			d4DRmzs94DKveDTB3hqw6PeBLrtpPep0H/+h </nc:BinaryBase64Object>
								<biom:ImageBitsPerPixelQuantity>8</biom:ImageBitsPerPixelQuantity>
								<biom:ImageCaptureDetail>
									<biom:CaptureDate>
										<nc:Date>2007-01-01</nc:Date>
									</biom:CaptureDate>
									<biom:CaptureOrganization>
										<nc:OrganizationIdentification>
											<nc:IdentificationID>WI013415Y</nc:IdentificationID>
										</nc:OrganizationIdentification>
										<nc:OrganizationName>WI CRIME INFORMATION BUREAU</nc:OrganizationName>
									</biom:CaptureOrganization>
								</biom:ImageCaptureDetail>
								<biom:ImageCompressionAlgorithmText>0</biom:ImageCompressionAlgorithmText>
								<biom:ImageHorizontalLineLengthPixelQuantity>65535</biom:ImageHorizontalLineLengthPixelQuantity>
								<biom:ImageHorizontalPixelDensityValue>1000</biom:ImageHorizontalPixelDensityValue>
								<biom:ImageScaleUnitsCode>1</biom:ImageScaleUnitsCode>
								<biom:ImageVerticalLineLengthPixelQuantity>65535</biom:ImageVerticalLineLengthPixelQuantity>
								<biom:ImageVerticalPixelDensityValue>1000</biom:ImageVerticalPixelDensityValue>
								<biom:FingerprintImageImpressionCaptureCategoryCode>0</biom:FingerprintImageImpressionCaptureCategoryCode>
								<biom:FingerPositionCode>1</biom:FingerPositionCode>
							</biom:FingerImpressionImage>
						</itl:PackageFingerprintImageRecord>
						<ident:MissingFingerprintImage>
							<biom:FingerPositionCode>3</biom:FingerPositionCode>
							<biom:FingerMissingCode>XX</biom:FingerMissingCode>
						</ident:MissingFingerprintImage>
					</ident:FingerprintImageSet>
				</ident:BiometricDetails>
			</ident:Encounter>
		</ident:IdentifyRequest>
	</soapenv:Body>
</soapenv:Envelope>
